Revit 2027 API
RebarHookType.GetDefaultHookExtension Method
 Computes the default hook length, which is equal to barDiameter * multiplier.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDefaultHookExtension(
	double barDiameter
)
Public Function GetDefaultHookExtension (
	barDiameter As Double
) As Double
public:
double GetDefaultHookExtension(
	double barDiameter
)
member GetDefaultHookExtension :
        barDiameter : float -> float
Parameters
barDiameter Double
Return Value
Double
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace